//;	*******************************************************************
//;	***																***
//;	***																***
//;	***		操作パネル通信メイン									***
//;	***		(定周期割込みでCALLされる方が良い)						***
//;	***																***
//;	***																***
//;	*******************************************************************
#include	"cm_equ1.h"
#include	"CPU_REG.h"
#include	"ssc_wrms.h"
#include	"ssc_ver1.h"
#include	"ssc_def.h"

/* 外部参照変数定義 -------------------------------------------------- */

/* 外部参照関数定義 -------------------------------------------------- */

/* プロトタイプ宣言 -------------------------------------------------- */
void	OPE_TX_DATA_MAKE(void);
void	OPE_TX_START(void);
UNs		OPE_RX_BCC_CHECK(void);
void	OPE_RX_DAT_GET(void);

/* テーブル定義 ------------------------------------------------------ */


//;**************************************************************
//;*****													*****
//;*****		通信メイン									*****
//;*****													*****
//;**************************************************************
void	OPE_SCI_MAIN(void)
{
	SCSCR2 |= cBIT6;					//いつでも受信割込み許可

	if (OPE_RX_TIM) {
		OPE_RX_TIM--;
	}

	switch(OPE_SCI_MODE) {
		case 0 : //送信開始処理
			OPE_TX_DATA_MAKE();
			OPE_SCI_MODE = 1;
			OPE_TX_START();
			break;

		case 1 : //送信中
			/* 特に何もしない */
			break;

		case 2 : //受信完了待ち
			if (OPE_RX_TIM == 0) {
				/* 送信ﾘﾄﾗｲ */
				OPE_SCI_MODE = 0;
			}

			else if (OPE_RX_END) {					//受信完了？
				/* 全データ受信完了 */
				if ( OPE_RX_BCC_CHECK() ) {
					OPE_RX_DAT_GET();
				}
				OPE_RX_END = 0;
				OPE_SCI_MODE = 0;
			}

			break;
	}
}


//;**************************************************************
//;*****													*****
//;*****		送信データ作成								*****
//;*****													*****
//;**************************************************************
void	OPE_TX_DATA_MAKE(void)
{
	UNb		bcc, i;
	
	bcc = 0;
	
	OPE_TX_BUF[0] = 0x5A;				//ｽﾀｰﾄｺｰﾄﾞ
	bcc += 0x5A;							//bcc

	OPE_TX_BUF[1] = 1;					//局番
	bcc += 1;							//bcc

	OPE_TX_BUF[2] = 12;					//送信ﾊﾞｲﾄ数(ｽﾀｰﾄｺｰﾄﾞからbccまでの全送信ﾊﾞｲﾄ数)
	bcc += 12;							//bcc

	OPE_TX_BUF[3] = 0;					//処理ｽﾃｰﾀｽ
	bcc += 0;							//bcc

	OPE_TX_BUF[4] = 5;					//ﾃﾞｰﾀﾊﾞｲﾄ数
	bcc += 5;							//bcc

	for (i=0; i<5; i++) {
		OPE_TX_BUF[5+i] = OPE_LED_DAT[i];	//ﾃﾞｰﾀ部
		bcc += OPE_TX_BUF[5+i];				//bcc
	}

	OPE_TX_BUF[10] = bcc;				//bcc

	OPE_TX_BUF[11] = ~bcc;				//~bcc

	OPE_TX_LEN = 12;
}


//;**************************************************************
//;*****													*****
//;*****		送信開始処理								*****
//;*****													*****
//;**************************************************************
void	OPE_TX_START(void)
{
	OPE_TX_POI = 0;
	OPE_RX_POI = 0;
	SCSCR2 |= cBIT7;					//ｴﾝﾌﾟﾃｨ割込み許可
}


//;**************************************************************
//;*****													*****
//;*****		受信データBCCチェック						*****
//;*****													*****
//;**************************************************************
UNs		OPE_RX_BCC_CHECK(void)
{
	UNs		i, k, bcc, err;

	bcc = 0;
	err = 0;

	i = OPE_RX_BUF[2];							//受信ﾊﾞｲﾄ数（13バイトのはず）
	i -= 2;

	for (k=0; k<i; k++) {						//受信ﾃﾞｰﾀのBCC作成
		bcc += OPE_RX_BUF[k];
	}

	if ( (bcc != OPE_RX_BUF[k]) || (~bcc != OPE_RX_BUF[k+1]) ) {
		err = 0xff;
	}

	return(err);
}


//;**************************************************************
//;*****													*****
//;*****		受信データGET								*****
//;*****													*****
//;**************************************************************
void	OPE_RX_DAT_GET(void)
{
	UNb		i;
	
	for (i=0; i<4; i++) {
		Key_Data_No[i] = OPE_RX_BUF[5+i];
	}
	Key_Data_Flg = 0xff;
}


//;**************************************************************
//;*****													*****
//;*****		受信ERR割込み								*****
//;*****													*****
//;**************************************************************
void	OPE_RE_INT(void)
{
	UNb		rdat, err;

	rdat = SCFRDR2;							//受信ﾃﾞｰﾀ読込み
	SCSSR2 &= ~cBIT1;						//RDFｸﾘｱ
	SCSSR2 &= ~cBIT7;						//ERｸﾘｱ
	OPE_RX_POI = 0;
}


//;**************************************************************
//;*****													*****
//;*****		受信割込み									*****
//;*****													*****
//;**************************************************************
void	OPE_RX_INT(void)
{
	UNb		rdat, err;

	rdat = SCFRDR2;							//受信ﾃﾞｰﾀ読込み
	SCSSR2 &= ~cBIT1;						//RDFｸﾘｱ

	err = 0;
	if (SCSSR2 & cBIT7) {					//受信ｴﾗｰ有り？
		SCSSR2 &= ~cBIT7;					//ERｸﾘｱ
		err = 0xff;
	}

	if (err) {
		return;
	}

	if (OPE_RX_POI == 0) {					//ﾌﾚｰﾑTOPのｽﾀｰﾄｺｰﾄﾞが来るまで待機
		if (rdat != 0x5A) {
			return;
		}
	}

	OPE_RX_BUF[OPE_RX_POI] = rdat;

	if (OPE_RX_POI == 2) {					//受信3ﾊﾞｲﾄ目？
		OPE_RX_BYTE = rdat;					//受信ﾊﾞｲﾄ数確定
	}

	if (OPE_RX_POI < 16) {					//1ﾌﾚｰﾑは最大16ﾊﾞｲﾄとする。
		OPE_RX_POI++;
	}

	if (OPE_RX_BYTE) {						//受信ﾊﾞｲﾄ数確定している？
		if (OPE_RX_BYTE <= OPE_RX_POI) {	//1ﾌﾚｰﾑ受信完了？
			if (OPE_RX_END == 0) {
				OPE_RX_END = 0xff;			//1ﾌﾚｰﾑ受信完了
			}
		}
	}
}


//;**************************************************************
//;*****													*****
//;*****		送信割込み									*****
//;*****													*****
//;**************************************************************
void	OPE_TX_INT(void)
{
	UNb		rdat;

	SCFTDR2 = OPE_TX_BUF[OPE_TX_POI];		//送信ﾃﾞｰﾀｾｯﾄ

	OPE_TX_POI++;
	if (OPE_TX_POI >= OPE_TX_LEN) {
		SCSCR2 &= ~cBIT7;					//送信ｴﾝﾌﾟﾃｨ割込み禁止
		OPE_RX_END = 0;
		OPE_RX_POI = 0;
		OPE_RX_TIM = 200;					//受信待ち時間1sec（5ms×200＝1sec）
		OPE_SCI_MODE = 2;
	}
}


