//	*******************************************************
//	***													***
//	***													***
//	***		本体(cpud)とシーケンスとのｲﾝﾀｰﾌｪｲｽ関数		***
//	***													***
//	***													***
//	***													***
//	******************************************************
//	本体とのｲﾝﾀｰﾌｪｲｽをこれだけ
//	[このﾌｧｲﾙ内ではｵﾘｼﾞﾅﾙの構造体,define,equを使用しない]

//	------------ 外部への定義 ------------
extern	void SqcInit1(void);	//
extern	void SqcInit2(void);	//
extern	void SqcIntHigh(void);	//1~3msec
extern	void SqcIntMDL(void);	//10msec
extern	void SqcMain(void);		//ﾊﾞｯｸｸﾞﾗﾝﾄﾞ
