//;	*******************************************************************
//;	***																***
//;	***																***
//;	***		ＨＭＩ各インターフェイスソフト							***
//;	***																***
//;	***																***
//;	*******************************************************************
#include	"cm_equ1.h"
#include	"ssc_wrmh.h"

extern	void	dsp_init1(void);						//割込み解除前1回
extern	void	dsp_init2(void);						//割込み解除後1回
extern	void	dsp_init3(void);						//ｲﾆｼｬﾙﾃﾞｰﾀ受信後1回
extern	void	dsp_time_5ms(void);						//5ms定周期処理
extern	void	dsp_main(void);							//画面表示メインルーチン
//V05j	extern	void	KJ_CHK_SUB(void);						//荷重計バックアップ化け不具合調査プログラム	V05i

#pragma section
//;	***********************************************************
//;	***														***
//;	***		HMI割込み解除前1回								***
//;	***														***
//;	***********************************************************
void hmi1_init1(void)
{
	dsp_init1();				//割込み解除前1回
}

//;	***********************************************************
//;	***														***
//;	***		HMI割込み解除後1回								***
//;	***														***
//;	***********************************************************
void hmi1_init2(void)
{
	dsp_init2();				//割込み解除後1回
}

//;	***********************************************************
//;	***														***
//;	***		HMIｲﾆｼｬﾙﾃﾞｰﾀ受信後1回							***
//;	***														***
//;	***********************************************************
void hmi1_init3(void)
{
	dsp_init3();				//ｲﾆｼｬﾙﾃﾞｰﾀ受信後1回
}

//;	***********************************************************
//;	***														***
//;	***		HMIﾒｲﾝｽｷｬﾝ										***
//;	***														***
//;	***********************************************************
void hmi1_main(void)
{
//V05j	KJ_CHK_SUB();				//荷重計バックアップ化け不具合調査プログラム	V05i
	dsp_main();					//画面表示メインルーチン
}

//;	***********************************************************
//;	***														***
//;	***		HMI定周期5ms									***
//;	***														***
//;	***********************************************************
void hmi1_int3(void)
{
	dsp_time_5ms();				//5ms定周期処理
}

